#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      + data             = (sensitive value)
      + data_json        = (sensitive value)
      + id               = (known after apply)
      + lease_duration   = (known after apply)
      + lease_id         = (known after apply)
      + lease_renewable  = (known after apply)
      + lease_start_time = (known after apply)
      + path             = "secret/suitable/terraform/stackdriver/slack-token"
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be created
  + resource "google_monitoring_notification_channel" "notification_channel" {
      + display_name        = "staging"
      + enabled             = true
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + project             = (known after apply)
      + type                = "slack"
      + verification_status = (known after apply)
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts will be created
  + resource "google_monitoring_alert_policy" "node_resource_alerts" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "k8s-node-resource-usage"
      + enabled               = true
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "terra-datarepo-staging"

      + conditions {
          + display_name = "node-cpu-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/node/cpu/allocatable_utilization\" resource.type=\"k8s_node\" "
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.labels.node_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }
      + conditions {
          + display_name = "node-memory-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/node/memory/allocatable_utilization\" resource.type=\"k8s_node\" metric.label.\"memory_type\"=\"non-evictable\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.labels.node_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }

      + documentation {
          + content   = "A cluster node has been running with high resource utilization for greater than 300seconds"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert will be created
  + resource "google_monitoring_alert_policy" "pod_health_alert" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "k8s-container-health-status"
      + enabled               = true
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "terra-datarepo-staging"

      + conditions {
          + display_name = "container-frequent-restarts"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "600s"
              + filter          = "metric.type=\"kubernetes.io/container/restart_count\" resource.type=\"k8s_container\""
              + threshold_value = 0

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.container_name",
                      + "resource.label.pod_name",
                    ]
                  + per_series_aligner   = "ALIGN_DELTA"
                }
            }
        }

      + documentation {
          + content   = "A container has been experiencing frequent restarts for greater than 5 minutes"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util will be created
  + resource "google_monitoring_alert_policy" "pod_memory_util" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "k8s-pod-resource-utilization"
      + enabled               = true
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "terra-datarepo-staging"

      + conditions {
          + display_name = "pod-memory-limit-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/container/memory/limit_utilization\" resource.type=\"k8s_container\" metric.label.\"memory_type\"=\"non-evictable\" resource.label.\"container_name\"!=\"metadata-proxy\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.pod_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }
      + conditions {
          + display_name = "pod-volume-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/pod/volume/utilization\" resource.type=\"k8s_pod\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.pod_name",
                      + "metric.label.volume_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }
      + conditions {
          + display_name = "pod-cpu-limit-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/container/cpu/limit_utilization\" resource.type=\"k8s_container\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.pod_name",
                      + "resource.label.container_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }

      + documentation {
          + content   = "A pod has been requesting greater than 95% of a resource limit for longer than 5 minutes"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0] will be created
  + resource "google_monitoring_alert_policy" "uptime-check" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "uptime check failed for data.staging.envs-terra.bio/"
      + enabled               = true
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "terra-datarepo-staging"

      + conditions {
          + display_name = "Uptime Health Check on data.staging.envs-terra.bio"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "0s"
              + filter          = (known after apply)
              + threshold_value = 1

              + aggregations {
                  + alignment_period     = "1200s"
                  + cross_series_reducer = "REDUCE_COUNT_FALSE"
                  + group_by_fields      = [
                      + "resource.*",
                    ]
                  + per_series_aligner   = "ALIGN_NEXT_OLDER"
                }

              + trigger {
                  + count   = 1
                  + percent = 0
                }
            }
        }

      + documentation {
          + content   = "https://data.staging.envs-terra.bio/"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0] will be created
  + resource "google_monitoring_uptime_check_config" "uptime-check-config" {
      + display_name     = "data.staging.envs-terra.bio/"
      + id               = (known after apply)
      + is_internal      = (known after apply)
      + name             = (known after apply)
      + period           = "900s"
      + project          = "terra-datarepo-staging"
      + selected_regions = [
          + "ASIA_PACIFIC",
          + "EUROPE",
          + "SOUTH_AMERICA",
          + "USA",
        ]
      + timeout          = "10s"
      + uptime_check_id  = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + mask_headers   = false
          + path           = "/"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true
        }

      + internal_checkers {
          + display_name    = (known after apply)
          + gcp_zone        = (known after apply)
          + name            = (known after apply)
          + network         = (known after apply)
          + peer_project_id = (known after apply)
        }

      + monitored_resource {
          + labels = {
              + "host"       = "data.staging.envs-terra.bio"
              + "project_id" = "terra-datarepo-staging"
            }
          + type   = "uptime_url"
        }

      + timeouts {}
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `environments/staging`*
